{
  "doc_id": "379956055d9fb7e5d2c7b6aa97727d9ca58d5579",
  "title": "AI can forecast your future health – just like the weather",
  "url": "https://www.bbc.com/news/articles/cx2pj502ev6o",
  "source": "BBC News",
  "publishedAt": "2025-09-17T15:19:58Z",
  "chunks": [
    "AI can forecast your future health – just like the weather 2 days ago Share Save James Gallagher Health and science correspondent Share Save Jeff Dowling/EMBL-EBI Researchers developed the code for the AI model which looks for patterns in people's medical records Artificial intelligence can predict people's health problems over a decade into the future, say scientists. The technology has learned to spot patterns in people's medical records to calculate their risk of more than 1,000 diseases. The researchers say it is like a weather forecast that anticipates a 70% chance of rain – but for human health. Their vision is to use the AI model to spot high-risk patients to prevent disease and to help hospitals understand demand in their area, years ahead of time. The model – called Delphi-2M - uses similar technology to well-known AI chatbots like ChatGPT. AI chatbots are trained to understand patterns of language so they can predict the sequence of words in a sentence. Delphi-2M has been trained to find patterns in anonymous medical records so it can predict what comes next and when. It doesn't predict exact dates, like a heart attack on October 1, but instead estimates the likelihood of 1,231 diseases. \"So, just like weather, where we could have a 70% chance of rain, we can do that for healthcare,\" Prof Ewan Birney, the interim executive director of the European Molecular Biology Laboratory, told me. \"And we can do that not just for one disease, but all diseases at the same time - we've never been able to do that before. I'm excited,\" he said. Jeff Dowling/EMBL-EBI Lead researcher Prof Ewan Birney says the model's disease predictions stack up The AI model was initially developed using anonymous UK data - including hospital admissions, GP records and lifestyle habits such as smoking - collected from more than 400,000 people as part of the UK Biobank research project. The model was then tested to see if its predictions stacked up using data from other Biobank participants, and then with 1.9 million people's medical records in Denmark. \"It's good, it's really good in",
    "smoking - collected from more than 400,000 people as part of the UK Biobank research project. The model was then tested to see if its predictions stacked up using data from other Biobank participants, and then with 1.9 million people's medical records in Denmark. \"It's good, it's really good in Denmark,\" says Prof Birney. \"If our model says it's a one-in-10 risk for the next year, it really does seem like it turns out to be one in 10.\" The model is best at predicting diseases like type 2 diabetes, heart attacks and sepsis that have a clear disease progression, rather than more random events like infections. What can you do with the results? People are already offered a cholesterol-lowering statin based on a calculation of their risk of a heart attack or stroke. The AI tool is not ready for clinical use, but the plan is to use it in a similar way, to spot high-risk patients while there is an opportunity to intervene early and prevent disease. This could include medicines or specific lifestyle advice - such as people likely to develop some liver disorders benefitting from cutting back their alcohol intake more than the general population. The artificial intelligence could also help inform disease-screening programmes and analyse all the healthcare records in an area to anticipate demand - such as how many heart attacks a year there will be in Norwich in 2030, to help plan resources. \"This is the beginning of a new way to understand human health and disease progression,\" said Prof Moritz Gerstung, head of the division of AI in oncology at DKFZ, the German Cancer Research Centre. He added: \"Generative models such as ours could one day help personalise care and anticipate healthcare needs at scale.\""
  ]
}